print("1st program") #вывод отметки начала первой "программы"
print(9 ** 0.5 * 5) #вывод результата вычисления первого выражения
print("\n-------------------\n") #визуальный разделитель между "программами"
print("2nd program") #вывод отметки начала второй "программы"
print(9.99 > 9.98 and 1000 != 1000.1) #вывод результата вычисления второго выражения
print("\n-------------------\n") #визуальный разделитель между "программами"
print("3rd program") #вывод отметки начала третьей "программы"
print(2 * 2 + 2) #вывод результата вычисления первого выражения третьего задания
print(2 * (2 + 2)) #вывод результата вычисления второго выражения третьего задания
print((2 * 2 + 2) == (2 * (2 + 2))) #вывод результата сравнения двух предыдущих ответов
print("\n-------------------\n") #визуальный разделитель между "программами"
print("4th program") #вывод отметки начала четвертой "программы"
number = '123.456' #объявление заданной переменной
number = float(number) #преврращение строки в дробное число
number = int(number * 10) #выведение четверки в целую часть и превращение в целочисленную переменную
number = number % 10 #получение остатка от деления на 10
print(number) #вывод результата
print(int(float('123.456') * 10) % 10) #однострочный вариант без переменных (я же не должен их ещё знать, верно?)
print("\nПоздравляю! Вы прочитали мой глупый код! (который и не мой вовсе, это всё инструкции)") #